<?php

namespace App\DataFixtures;

use App\Repository\ReviewRepository;
use Doctrine\Persistence\ObjectManager;
use Doctrine\Bundle\FixturesBundle\Fixture;

class UserReviewFixture extends Fixture
{
    public function __construct(
        private readonly ReviewRepository $reviewRepository
    ) {}

    public function load(ObjectManager $manager): void
    {
        $reviews = [
            [
                "product" => 1,
                "grade" => 85,
                "comment" => "Шоколад вкусный, но чуть дороговат.",
                "user" => 2
            ],
            [
                "product" => 2,
                "grade" => 72,
                "comment" => "Игрушка довольно качественная, но кот не сильно заинтересовался.",
                "user" => 3
            ],
            [
                "product" => 3,
                "grade" => 90,
                "comment" => "Отличный смартфон, скорость работы на высоте.",
                "user" => 4
            ],
            [
                "product" => 4,
                "grade" => 50,
                "comment" => "Миксер неплохой, но сильно шумит.",
                "user" => 5
            ],
            [
                "product" => 5,
                "grade" => 60,
                "comment" => "Средство неплохое, но запах немного резкий.",
                "user" => 6
            ],
            [
                "product" => 6,
                "grade" => 95,
                "comment" => "Рубашка отличного качества, идеально села по размеру.",
                "user" => 7
            ],
            [
                "product" => 7,
                "grade" => 20,
                "comment" => "Неудобные, быстро порвались.",
                "user" => 8
            ],
            [
                "product" => 8,
                "grade" => 40,
                "comment" => "Конструктор хороший, но детали плохо соединяются.",
                "user" => 2
            ],
            [
                "product" => 9,
                "grade" => 80,
                "comment" => "Тональный крем подошел, но немного суховат.",
                "user" => 3
            ],
            [
                "product" => 10,
                "grade" => 100,
                "comment" => "Лучший парфюм, аромат на весь день!",
                "user" => 4
            ],
            [
                "product" => 11,
                "grade" => 65,
                "comment" => "Набор посуды качественный, но покрытие быстро царапается.",
                "user" => 5
            ],
            [
                "product" => 12,
                "grade" => 90,
                "comment" => "Отличная бутылка, удобно носить с собой.",
                "user" => 6
            ],
            [
                "product" => 13,
                "grade" => 55,
                "comment" => "Гантели неплохие, но запах резины слишком сильный.",
                "user" => 7
            ],
            [
                "product" => 14,
                "grade" => 80,
                "comment" => "Чехол качественный, но немного тяжеловат.",
                "user" => 8
            ],
            [
                "product" => 15,
                "grade" => 70,
                "comment" => "Аккумулятор хороший, но цена завышена.",
                "user" => 2
            ],
            [
                "product" => 16,
                "grade" => 95,
                "comment" => "Роман великолепен, читается на одном дыхании.",
                "user" => 3
            ],
            [
                "product" => 17,
                "grade" => 100,
                "comment" => "Постельное белье мягкое и приятное на ощупь.",
                "user" => 4
            ],
            [
                "product" => 18,
                "grade" => 85,
                "comment" => "Ремень качественный, но немного жестковат.",
                "user" => 5
            ],
            [
                "product" => 19,
                "grade" => 60,
                "comment" => "Сковорода хорошая, но покрытие легко повреждается.",
                "user" => 6
            ],
            [
                "product" => 20,
                "grade" => 95,
                "comment" => "Планшет отличный, экран яркий, работает быстро.",
                "user" => 7
            ],
            [
                "product" => 21,
                "grade" => 50,
                "comment" => "Карта памяти нормальная, но иногда зависает.",
                "user" => 8
            ],
            [
                "product" => 22,
                "grade" => 90,
                "comment" => "Кофемашина отличная, но шумная.",
                "user" => 2
            ],
            [
                "product" => 23,
                "grade" => 100,
                "comment" => "Потрясающее кольцо, идеально подходит для подарка.",
                "user" => 3
            ],
            [
                "product" => 24,
                "grade" => 70,
                "comment" => "Дрель хорошая, но аккумуляторы быстро разряжаются.",
                "user" => 4
            ],
            [
                "product" => 25,
                "grade" => 85,
                "comment" => "Витамины хорошие, чувствую себя лучше.",
                "user" => 5
            ],
            [
                "product" => 26,
                "grade" => 100,
                "comment" => "Игры для PS5 потрясающие, хорошая графика.",
                "user" => 6
            ],
            [
                "product" => 27,
                "grade" => 80,
                "comment" => "Наушники отличные, но не так удобно носить на долго.",
                "user" => 7
            ],
            [
                "product" => 1,
                "grade" => 95,
                "comment" => "Очень вкусный шоколад, приятно удивил!",
                "user" => 2
            ],
            [
                "product" => 3,
                "grade" => 55,
                "comment" => "Игрушка нормальная, но кот быстро потерял интерес.",
                "user" => 3
            ],
            [
                "product" => 5,
                "grade" => 88,
                "comment" => "Смартфон хороший, но батарея могла бы держать дольше.",
                "user" => 4
            ],
            [
                "product" => 6,
                "grade" => 78,
                "comment" => "Миксер вполне хороший, но не хватает мощности для тяжелых смесей.",
                "user" => 5
            ],
            [
                "product" => 2,
                "grade" => 90,
                "comment" => "Отличное средство для уборки, запах приятный.",
                "user" => 6
            ],
            [
                "product" => 8,
                "grade" => 80,
                "comment" => "Рубашка классная, но размер чуть великоват.",
                "user" => 7
            ],
            [
                "product" => 7,
                "grade" => 50,
                "comment" => "Кроссовки нормальные, но неудобные при долгих прогулках.",
                "user" => 8
            ],
            [
                "product" => 4,
                "grade" => 65,
                "comment" => "Конструктор хороший, но детали теряются.",
                "user" => 2
            ],
            [
                "product" => 9,
                "grade" => 78,
                "comment" => "Тональный крем неплохой, но забивается в поры.",
                "user" => 3
            ],
            [
                "product" => 10,
                "grade" => 100,
                "comment" => "Обожаю этот парфюм, не могу без него!",
                "user" => 4
            ],
            [
                "product" => 11,
                "grade" => 70,
                "comment" => "Посуда хорошая, но немного тонкая.",
                "user" => 5
            ],
            [
                "product" => 12,
                "grade" => 85,
                "comment" => "Бутылка отличная, но быстро оставляет следы от пальцев.",
                "user" => 6
            ],
            [
                "product" => 13,
                "grade" => 75,
                "comment" => "Гантели хорошего качества, но запах резины слишком сильный.",
                "user" => 7
            ],
            [
                "product" => 14,
                "grade" => 90,
                "comment" => "Чехол для смартфона очень качественный, но хотелось бы побольше цвета.",
                "user" => 8
            ],
            [
                "product" => 15,
                "grade" => 95,
                "comment" => "Отличный аккумулятор, долго держит заряд.",
                "user" => 2
            ],
            [
                "product" => 16,
                "grade" => 80,
                "comment" => "Роман классный, но некоторые моменты слишком сложны для восприятия.",
                "user" => 3
            ],
            [
                "product" => 17,
                "grade" => 100,
                "comment" => "Постельное белье мягкое и нежное, очень приятное на ощупь.",
                "user" => 4
            ],
            [
                "product" => 18,
                "grade" => 85,
                "comment" => "Ремень качественный, но немного жестковат.",
                "user" => 5
            ],
            [
                "product" => 19,
                "grade" => 90,
                "comment" => "Сковорода отличная, готовить одно удовольствие!",
                "user" => 6
            ],
            [
                "product" => 20,
                "grade" => 95,
                "comment" => "Планшет шикарный, скорость работы впечатляет.",
                "user" => 7
            ],
            [
                "product" => 21,
                "grade" => 70,
                "comment" => "Карта памяти нормальная, но скорость записи могла бы быть быстрее.",
                "user" => 8
            ],
            [
                "product" => 22,
                "grade" => 88,
                "comment" => "Кофемашина хорошая, но дольше, чем ожидал, готовит кофе.",
                "user" => 2
            ],
            [
                "product" => 23,
                "grade" => 95,
                "comment" => "Кольцо великолепное, выглядит очень стильно.",
                "user" => 3
            ],
            [
                "product" => 24,
                "grade" => 65,
                "comment" => "Дрель нормальная, но аккумуляторы разряжаются слишком быстро.",
                "user" => 4
            ],
            [
                "product" => 25,
                "grade" => 85,
                "comment" => "Витамины хорошие, но эффект не сразу заметен.",
                "user" => 5
            ],
            [
                "product" => 26,
                "grade" => 95,
                "comment" => "Игры для PS5 потрясающие, стоит своих денег.",
                "user" => 6
            ],
            [
                "product" => 27,
                "grade" => 90,
                "comment" => "Наушники отличные, звук шикарный.",
                "user" => 7
            ],
            [
                "product" => 1,
                "grade" => 85,
                "comment" => "Очень вкусный шоколад, но упаковка не очень.",
                "user" => 5
            ],
            [
                "product" => 3,
                "grade" => 95,
                "comment" => "Отличный смартфон, быстрый и функциональный.",
                "user" => 6
            ],
            [
                "product" => 19,
                "grade" => 80,
                "comment" => "Сковорода хорошая, но приходится использовать масло.",
                "user" => 8
            ],
            [
                "product" => 7,
                "grade" => 60,
                "comment" => "Кроссовки удобные, но не для долгих пробежек.",
                "user" => 2
            ],
            [
                "product" => 8,
                "grade" => 70,
                "comment" => "Конструктор интересный, но детали маленькие.",
                "user" => 3
            ]
        ];

        foreach ($reviews as $value) {
            $this->reviewRepository->create($value);
        }
    }
}
